results/run-30vu.txt

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 30 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 30 VUs  0m01.0s/1m0s

running (0m02.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 30 VUs  0m02.0s/1m0s

running (0m03.0s), 30/30 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 30 VUs  0m03.0s/1m0s

running (0m04.0s), 30/30 VUs, 16 complete and 0 interrupted iterations
default   [   7% ] 30 VUs  0m04.0s/1m0s

running (0m05.0s), 30/30 VUs, 32 complete and 0 interrupted iterations
default   [   8% ] 30 VUs  0m05.0s/1m0s

running (0m06.0s), 30/30 VUs, 48 complete and 0 interrupted iterations
default   [  10% ] 30 VUs  0m06.0s/1m0s

running (0m07.0s), 30/30 VUs, 70 complete and 0 interrupted iterations
default   [  12% ] 30 VUs  0m07.0s/1m0s

running (0m08.0s), 30/30 VUs, 88 complete and 0 interrupted iterations
default   [  13% ] 30 VUs  0m08.0s/1m0s

running (0m09.0s), 30/30 VUs, 101 complete and 0 interrupted iterations
default   [  15% ] 30 VUs  0m09.0s/1m0s

running (0m10.0s), 30/30 VUs, 118 complete and 0 interrupted iterations
default   [  17% ] 30 VUs  0m10.0s/1m0s

running (0m11.0s), 30/30 VUs, 135 complete and 0 interrupted iterations
default   [  18% ] 30 VUs  0m11.0s/1m0s

running (0m12.0s), 30/30 VUs, 156 complete and 0 interrupted iterations
default   [  20% ] 30 VUs  0m12.0s/1m0s

running (0m13.0s), 30/30 VUs, 167 complete and 0 interrupted iterations
default   [  22% ] 30 VUs  0m13.0s/1m0s

running (0m14.0s), 30/30 VUs, 186 complete and 0 interrupted iterations
default   [  23% ] 30 VUs  0m14.0s/1m0s

running (0m15.0s), 30/30 VUs, 201 complete and 0 interrupted iterations
default   [  25% ] 30 VUs  0m15.0s/1m0s

running (0m16.0s), 30/30 VUs, 221 complete and 0 interrupted iterations
default   [  27% ] 30 VUs  0m16.0s/1m0s

running (0m17.0s), 30/30 VUs, 241 complete and 0 interrupted iterations
default   [  28% ] 30 VUs  0m17.0s/1m0s

running (0m18.0s), 30/30 VUs, 256 complete and 0 interrupted iterations
default   [  30% ] 30 VUs  0m18.0s/1m0s

running (0m19.0s), 30/30 VUs, 272 complete and 0 interrupted iterations
default   [  32% ] 30 VUs  0m19.0s/1m0s

running (0m20.0s), 30/30 VUs, 289 complete and 0 interrupted iterations
default   [  33% ] 30 VUs  0m20.0s/1m0s

running (0m21.0s), 30/30 VUs, 307 complete and 0 interrupted iterations
default   [  35% ] 30 VUs  0m21.0s/1m0s

running (0m22.0s), 30/30 VUs, 322 complete and 0 interrupted iterations
default   [  37% ] 30 VUs  0m22.0s/1m0s

running (0m23.0s), 30/30 VUs, 341 complete and 0 interrupted iterations
default   [  38% ] 30 VUs  0m23.0s/1m0s

running (0m24.0s), 30/30 VUs, 356 complete and 0 interrupted iterations
default   [  40% ] 30 VUs  0m24.0s/1m0s

running (0m25.0s), 30/30 VUs, 371 complete and 0 interrupted iterations
default   [  42% ] 30 VUs  0m25.0s/1m0s

running (0m26.0s), 30/30 VUs, 388 complete and 0 interrupted iterations
default   [  43% ] 30 VUs  0m26.0s/1m0s

running (0m27.0s), 30/30 VUs, 404 complete and 0 interrupted iterations
default   [  45% ] 30 VUs  0m27.0s/1m0s

running (0m28.0s), 30/30 VUs, 420 complete and 0 interrupted iterations
default   [  47% ] 30 VUs  0m28.0s/1m0s

running (0m29.0s), 30/30 VUs, 438 complete and 0 interrupted iterations
default   [  48% ] 30 VUs  0m29.0s/1m0s

running (0m30.0s), 30/30 VUs, 456 complete and 0 interrupted iterations
default   [  50% ] 30 VUs  0m30.0s/1m0s

running (0m31.0s), 30/30 VUs, 473 complete and 0 interrupted iterations
default   [  52% ] 30 VUs  0m31.0s/1m0s

running (0m32.0s), 30/30 VUs, 488 complete and 0 interrupted iterations
default   [  53% ] 30 VUs  0m32.0s/1m0s

running (0m33.0s), 30/30 VUs, 505 complete and 0 interrupted iterations
default   [  55% ] 30 VUs  0m33.0s/1m0s

running (0m34.0s), 30/30 VUs, 520 complete and 0 interrupted iterations
default   [  57% ] 30 VUs  0m34.0s/1m0s

running (0m35.0s), 30/30 VUs, 536 complete and 0 interrupted iterations
default   [  58% ] 30 VUs  0m35.0s/1m0s

running (0m36.0s), 30/30 VUs, 553 complete and 0 interrupted iterations
default   [  60% ] 30 VUs  0m36.0s/1m0s

running (0m37.0s), 30/30 VUs, 574 complete and 0 interrupted iterations
default   [  62% ] 30 VUs  0m37.0s/1m0s

running (0m38.0s), 30/30 VUs, 586 complete and 0 interrupted iterations
default   [  63% ] 30 VUs  0m38.0s/1m0s

running (0m39.0s), 30/30 VUs, 605 complete and 0 interrupted iterations
default   [  65% ] 30 VUs  0m39.0s/1m0s

running (0m40.0s), 30/30 VUs, 621 complete and 0 interrupted iterations
default   [  67% ] 30 VUs  0m40.0s/1m0s

running (0m41.0s), 30/30 VUs, 639 complete and 0 interrupted iterations
default   [  68% ] 30 VUs  0m41.0s/1m0s

running (0m42.0s), 30/30 VUs, 655 complete and 0 interrupted iterations
default   [  70% ] 30 VUs  0m42.0s/1m0s

running (0m43.0s), 30/30 VUs, 671 complete and 0 interrupted iterations
default   [  72% ] 30 VUs  0m43.0s/1m0s

running (0m44.0s), 30/30 VUs, 693 complete and 0 interrupted iterations
default   [  73% ] 30 VUs  0m44.0s/1m0s

running (0m45.0s), 30/30 VUs, 706 complete and 0 interrupted iterations
default   [  75% ] 30 VUs  0m45.0s/1m0s

running (0m46.0s), 30/30 VUs, 726 complete and 0 interrupted iterations
default   [  77% ] 30 VUs  0m46.0s/1m0s

running (0m47.0s), 30/30 VUs, 737 complete and 0 interrupted iterations
default   [  78% ] 30 VUs  0m47.0s/1m0s

running (0m48.0s), 30/30 VUs, 757 complete and 0 interrupted iterations
default   [  80% ] 30 VUs  0m48.0s/1m0s

running (0m49.0s), 30/30 VUs, 769 complete and 0 interrupted iterations
default   [  82% ] 30 VUs  0m49.0s/1m0s

running (0m50.0s), 30/30 VUs, 783 complete and 0 interrupted iterations
default   [  83% ] 30 VUs  0m50.0s/1m0s

running (0m51.0s), 30/30 VUs, 797 complete and 0 interrupted iterations
default   [  85% ] 30 VUs  0m51.0s/1m0s

running (0m52.0s), 30/30 VUs, 815 complete and 0 interrupted iterations
default   [  87% ] 30 VUs  0m52.0s/1m0s

running (0m53.0s), 30/30 VUs, 829 complete and 0 interrupted iterations
default   [  88% ] 30 VUs  0m53.0s/1m0s

running (0m54.0s), 30/30 VUs, 845 complete and 0 interrupted iterations
default   [  90% ] 30 VUs  0m54.0s/1m0s

running (0m55.0s), 30/30 VUs, 862 complete and 0 interrupted iterations
default   [  92% ] 30 VUs  0m55.0s/1m0s

running (0m56.0s), 30/30 VUs, 876 complete and 0 interrupted iterations
default   [  93% ] 30 VUs  0m56.0s/1m0s

running (0m57.0s), 30/30 VUs, 894 complete and 0 interrupted iterations
default   [  95% ] 30 VUs  0m57.0s/1m0s

running (0m58.0s), 30/30 VUs, 911 complete and 0 interrupted iterations
default   [  97% ] 30 VUs  0m58.0s/1m0s

running (0m59.0s), 30/30 VUs, 926 complete and 0 interrupted iterations
default   [  98% ] 30 VUs  0m59.0s/1m0s

running (1m00.0s), 30/30 VUs, 940 complete and 0 interrupted iterations
default   [ 100% ] 30 VUs  1m00.0s/1m0s

running (1m01.0s), 13/30 VUs, 958 complete and 0 interrupted iterations
default Γåô [ 100% ] 30 VUs  1m0s

running (1m02.0s), 03/30 VUs, 968 complete and 0 interrupted iterations
default Γåô [ 100% ] 30 VUs  1m0s


  Γûê TOTAL RESULTS 

    checks_total.......: 971     15.632487/s
    checks_succeeded...: 100.00% 971 out of 971
    checks_failed......: 0.00%   0 out of 971

    Γ£ô status 200 ╨▒╨░╨╣╨╜╨░

    HTTP
    http_req_duration..............: avg=412.56ms min=75.49ms med=267.64ms max=7.9s  p(90)=976.94ms p(95)=1.19s
      { expected_response:true }...: avg=412.56ms min=75.49ms med=267.64ms max=7.9s  p(90)=976.94ms p(95)=1.19s
    http_req_failed................: 0.00%  0 out of 1942
    http_reqs......................: 1942   31.264975/s

    EXECUTION
    iteration_duration.............: avg=1.88s    min=1.31s   med=1.64s    max=9.49s p(90)=2.37s    p(95)=3.01s
    iterations.....................: 971    15.632487/s
    vus............................: 3      min=3         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 3.8 MB 61 kB/s
    data_sent......................: 192 kB 3.1 kB/s



running (1m02.1s), 00/30 VUs, 971 complete and 0 interrupted iterations
default Γ£ô [ 100% ] 30 VUs  1m0s